
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Adix A. 후기 · Functional programming in Scala</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="Chapter5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Chapter1.html">
            
                <a href="Chapter1.html">
            
                    
                    Ch1. 패러다임의 전환
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="Chapter2.html">
            
                <a href="Chapter2.html">
            
                    
                    Ch2. 참조 투명성, 순수성, 그리고 치환 모형
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Chapter3.html">
            
                <a href="Chapter3.html">
            
                    
                    Ch3. 모노이드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Chapter4.html">
            
                <a href="Chapter4.html">
            
                    
                    Ch4. 펑터
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Chapter5.html">
            
                <a href="Chapter5.html">
            
                    
                    Ch5. 모나드
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="Appendix-a.html">
            
                <a href="Appendix-a.html">
            
                    
                    Adix A. 후기
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Adix A. 후기</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#xC2A4;&#xD130;&#xB514;&#xB97C;-&#xD558;&#xBA74;&#xC11C;-&#xB290;&#xB080;&#xC810;-&#xBC0F;-&#xB9FA;&#xC74C;&#xB9D0;">&#xC2A4;&#xD130;&#xB514;&#xB97C; &#xD558;&#xBA74;&#xC11C; &#xB290;&#xB080;&#xC810; &#xBC0F; &#xB9FA;&#xC74C;&#xB9D0;</h2>
<h3 id="&#xC870;&#xB3D9;&#xD638;">&#xC870;&#xB3D9;&#xD638;</h3>
<p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xD070; &#xAD00;&#xC2EC;&#xC774; &#xC788;&#xC5C8;&#xB358; &#xAC83;&#xC740; &#xC544;&#xB2C8;&#xB2E4;. Google&#xC758; Guava Library&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;&#xC11C; &#xCF54;&#xB4DC;&#xC758; &#xAC00;&#xB3C5;&#xC131;&#xC774;&#xB77C;&#xB294; &#xC8FC;&#xC81C;&#xC5D0; &#xB300;&#xD574; &#xC0DD;&#xAC01;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xACE0;, Java &#xC678;&#xC758; &#xB2E4;&#xB978; &#xC5B8;&#xC5B4;&#xB4E4;&#xC740; &#xC5B4;&#xB5BB;&#xAC8C;&#xB4E4; &#xC4F0;&#xACE0; &#xC788;&#xB098; &#xBCF4;&#xAE30; &#xC2DC;&#xC791;&#xD558;&#xBA74;&#xC11C; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xAC8C; Scala&#xC640; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC73C;&#xB85C; &#xAD00;&#xC2EC;&#xC774; &#xC62E;&#xACA8;&#xAC00;&#xAC8C; &#xB418;&#xC5C8;&#xB358; &#xAC83; &#xAC19;&#xB2E4;. Functional&#xD558;&#xAC8C; &#xC791;&#xC131;&#xB41C; &#xCF54;&#xB4DC;&#xB294; &#xADF8;&#xB807;&#xC9C0; &#xC54A;&#xC740; &#xCF54;&#xB4DC;&#xC5D0; &#xBE44;&#xD574; &#xD655;&#xC2E4;&#xD788; &#xC77D;&#xAE30;&#xAC00; &#xC218;&#xC6D4;&#xD558;&#xB2E4;. &#xC9C0;&#xAE08; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xBA74; &#xC0C1;&#xD0DC; &#xBCC0;&#xACBD;&#xC774; &#xC5C6;&#xB294; &#xCF54;&#xB4DC;&#xAC00; &#xB354; &#xC77D;&#xAE30; &#xC26C;&#xC6B4;&#xAC8C; &#xB2F9;&#xC5F0;&#xD55C; &#xAC70;&#xC9C0;&#xB9CC; &#xADF8;&#xB54C;&#xB294; &#xADF8;&#xB7F0; &#xC0DD;&#xAC01;&#xC744; &#xBABB;&#xD588;&#xC5C8;&#xB2E4;. &#xC5B4;&#xB5A4; &#xCF54;&#xB4DC;&#xB294; &#xC798; &#xC77D;&#xD788;&#xB294;&#xB370; &#xC65C; &#xC5B4;&#xB5A4; &#xCF54;&#xB4DC;&#xB294; &#xBCFC; &#xB54C;&#xB9C8;&#xB2E4; &#xD5F7;&#xAC08;&#xB9AC;&#xB294; &#xAC78;&#xAE4C;. &#xADF8;&#xB7F0; &#xC791;&#xC740; &#xC758;&#xBB38;&#xC5D0;&#xC11C; &#xC2DC;&#xC791;&#xD588;&#xB358; &#xAC83;&#xC774; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD55C; &#xACF5;&#xBD80;&#xC5D0;&#xAE4C;&#xC9C0; &#xC774;&#xB974;&#xB800;&#xB2E4;. &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD574; &#xACF5;&#xBD80;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC990;&#xAC70;&#xC6B4; &#xC77C;&#xC774;&#xC5C8;&#xB2E4;. &#xD06C;&#xAC8C; &#xC758;&#xC2DD;&#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xC0AC;&#xC6A9;&#xD588;&#xB358; &#xD568;&#xC218;&#xB4E4;&#xC744; &#xD55C;&#xBC88; &#xB354; &#xB4E4;&#xC5EC;&#xBCF4;&#xB2E4; &#xADF8;&#xB4E4;&#xC774; &#xC9C0;&#xB2CC; &#xD568;&#xC758;&#xB97C; &#xAE68;&#xB2EC;&#xC544; &#xAC00;&#xB294; &#xACFC;&#xC815;&#xC740; &#xADF8; &#xB098;&#xB984;&#xC758; &#xB9E4;&#xB825;&#xC774; &#xC788;&#xB294; &#xC77C;&#xC774;&#xC5C8;&#xB2E4;. &#xD070; &#xAE68;&#xB2EC;&#xC74C;&#xC774;&#xB098; &#xC644;&#xBCBD;&#xD55C; &#xC774;&#xD574;&#xB97C; &#xC5BB;&#xC9C0; &#xBABB;&#xD574;&#xB3C4; &#xC88B;&#xB2E4;. &#xB2F9;&#xC7A5;&#xC740; &#xC5B4;&#xB835;&#xB354;&#xB77C;&#xB3C4; &#xADF8;&#xB7EC;&#xD55C; &#xAD00;&#xC2EC;&#xACFC; &#xB178;&#xB825;&#xC774; &#xC774;&#xC5B4;&#xC9C0;&#xB294;&#xD55C;, &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xB97C; &#xC810;&#xC810; &#xB354; &#xD568;&#xC218;&#xC801;&#xC73C;&#xB85C; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xB9AC;&#xB77C; &#xBBFF;&#xB294;&#xB2E4;.</p>
<h3 id="&#xAE40;&#xC9C4;&#xC5B5;">&#xAE40;&#xC9C4;&#xC5B5;</h3>
<p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xC7A5;&#xC810;&#xC774; &#xB9CE;&#xC74C;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xB9CE;&#xC740; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC774; &#xC5B4;&#xB824;&#xC6CC; &#xD558;&#xACE0; &#xAEBC;&#xB824;&#xD558;&#xB294; &#xC774;&#xC720;&#xB294; &#xC218;&#xD559;&#xC801; &#xC774;&#xB860;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD55C; &#xCD94;&#xC0C1;&#xC801;&#xC778; &#xAC1C;&#xB150;&#xB4E4; &#xB54C;&#xBB38;&#xC774;&#xB77C; &#xC0DD;&#xAC01;&#xB41C;&#xB2E4;. &#xCE74;&#xD14C;&#xACE0;&#xB9AC; &#xC774;&#xB860;, &#xD391;&#xD130;, &#xBAA8;&#xB178;&#xC774;&#xB4DC;, &#xBAA8;&#xB098;&#xB4DC; &#xB4F1;&#xB4F1; &#xC774; &#xBAA8;&#xB4E0; &#xAC1C;&#xB150;&#xB4E4;&#xC774; &#xC0DD;&#xC18C;&#xD558;&#xAE30;&#xB3C4; &#xD558;&#xC9C0;&#xB9CC;, &#xAC80;&#xC0C9; &#xD588;&#xC744; &#xB54C; &#xADF8; &#xACB0;&#xACFC; &#xB0B4;&#xC6A9;&#xC774; &#xB354; &#xC774;&#xD574;&#xD558;&#xAE30; &#xC5B4;&#xB824;&#xC6CC; &#xB9CE;&#xC740; &#xC0AC;&#xB78C;&#xB4E4;&#xC744; &#xC88C;&#xC808;&#xC5D0; &#xBE60;&#xD2B8;&#xB9AC;&#xB294; &#xAC83; &#xAC19;&#xB2E4;. &#xC218;&#xD559; &#xC774;&#xB860;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xD588;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xC218;&#xD559;&#xC801; &#xAC1C;&#xB150;&#xB4E4;&#xC744; &#xC774;&#xD574;&#xD558;&#xACE0; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xC811;&#xADFC;&#xD55C;&#xB2E4;&#xBA74; &#xB354; &#xB3C4;&#xC6C0;&#xC774; &#xB418;&#xACA0;&#xC9C0;&#xB9CC;, &#xAD73;&#xC774; &#xC774;&#xB97C; &#xC774;&#xD574;&#xD558;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xC811;&#xADFC;&#xD558;&#xB294;&#xB370; &#xD06C;&#xAC8C; &#xBB38;&#xC81C;&#xAC00; &#xB418;&#xC9C0; &#xC54A;&#xC73C;&#xB9AC;&#xB77C; &#xC0DD;&#xAC01;&#xB41C;&#xB2E4;. &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C;&#xB294; &#xD568;&#xC218;&#xC758; &#xCD94;&#xC0C1;&#xD654;&#xB97C; &#xD1B5;&#xD574;&#xC11C; &#xD568;&#xC218;&#xB97C; &#xC7AC;&#xC0AC;&#xC6A9; &#xD568;&#xC73C;&#xB85C;&#xC368; &#xD6A8;&#xC728;&#xC801;&#xC778; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC608;&#xC804;&#xC5D0; &#xC911;,&#xACE0;&#xB4F1;&#xD559;&#xAD50;&#xC5D0;&#xC11C; &#xC218;&#xD559;&#xC744; &#xBC30;&#xC6B8;&#xB54C; &#xACF5;&#xC2DD;&#xC744; &#xBC30;&#xC6B0;&#xACE0;, &#xC774; &#xACF5;&#xC2DD;&#xC744; &#xC801;&#xC6A9;&#xD574; &#xB2F5;&#xC744; &#xC5BB;&#xAC70;&#xB098; &#xB610; &#xB2E4;&#xB978; &#xACB0;&#xACFC;&#xB97C; &#xC720;&#xCD94;&#xD560; &#xC218; &#xC788;&#xC5C8;&#xB358; &#xAC83; &#xCC98;&#xB7FC;, &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C;&#xC758; &#xCD94;&#xC0C1;&#xD654;(Monoid, Functor, Monad &#xB4F1;&#xB4F1;)&#xB97C; &#xD1B5;&#xD574;, &#xB610; &#xB2E4;&#xB4E0; &#xACB0;&#xACFC;&#xB97C; &#xC5BB;&#xAC70;&#xB098; &#xB610; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB4E4;&#xC744; &#xB9CC;&#xB4E4;&#xC5B4; &#xD6A8;&#xC728;&#xC801;&#xC778; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xD560; &#xC218; &#xC788;&#xB2E4;. &#xCD94;&#xC0C1;&#xC801;&#xC778; &#xC6A9;&#xC5B4;&#xC5D0; &#xB108;&#xBB34; &#xC9D1;&#xCC29;&#xD574;&#xC11C; &#xC88C;&#xC808;&#xC744; &#xB9DB;&#xBCF4;&#xAE30; &#xBCF4;&#xB2E4;&#xB294; (&#xB77C;&#xC774;&#xD504;&#xB2C8;&#xCE20;&#xC758; &#xBAA8;&#xB098;&#xB4DC;, &#xCE74;&#xD14C;&#xACE0;&#xB9AC; &#xC774;&#xB860;&#xC744; &#xB530;&#xB77C;&#xAC14;&#xB2E4;&#xAC00; &#xD06C;&#xAC8C; &#xB0AD;&#xD328;&#xB97C; &#xBD24;&#xB2E4;&#xB294;&#x2026;), &#xB2E8;&#xC21C;&#xD558;&#xAC8C; &#xBC1B;&#xC544;&#xB4E4;&#xC774;&#xACE0;, &#xCF54;&#xB4DC;, &#xD568;&#xC218;&#xC758; &#xACF5;&#xD1B5;&#xC810;, &#xBC95;&#xCE59;&#xC744; &#xAE30;&#xBC18;&#xC73C;&#xB85C; &#xC774;&#xAC83;&#xB4E4;&#xB85C; &#xC778;&#xD574; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294; &#xC774;&#xC810;&#xB4E4;&#xC744; &#xBC30;&#xC6B0;&#xACE0; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC790;&#xC5F0;&#xC2A4;&#xB7FD;&#xAC8C; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xC775;&#xC219;&#xD574;&#xC9C0;&#xC9C0; &#xC54A;&#xC744;&#xAE4C; &#xC0DD;&#xAC01;&#xB41C;&#xB2E4;. </p>
<h3 id="&#xAE40;&#xACBD;&#xBC94;">&#xAE40;&#xACBD;&#xBC94;</h3>
<p>&#xCC98;&#xC74C; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xAD00;&#xC2EC;&#xC744; &#xAC16;&#xAC8C; &#xB41C; &#xACC4;&#xAE30;&#xB294; Play framework&#xB97C; &#xC2A4;&#xCE7C;&#xB77C;&#xB85C; &#xACF5;&#xBD80;&#xBA74;&#xC11C; &#xC2DC;&#xC791;&#xB418;&#xC5C8;&#xB2E4;. &#xCC98;&#xC74C; &#xAC1C;&#xBC1C;&#xC790;&#xB85C; &#xC9C1;&#xC7A5;&#xC744; &#xAD6C;&#xD558;&#xACE0; &#xC0C8;&#xB85C;&#xC6B4; &#xAC83;&#xC5D0; &#xB300;&#xD55C; &#xD638;&#xAE30;&#xC2EC;&#xC73C;&#xB85C; &#xC2DC;&#xC791;&#xD55C; &#xC2A4;&#xD130;&#xB514;&#xC600;&#xB2E4;. &#xC544;&#xC9C1;&#xB3C4; &#xADF8;&#xB54C; &#xB180;&#xB790;&#xB358; &#xAC10;&#xC815;&#xC774; &#xB0A8;&#xC544; &#xC788;&#xB2E4;. for &#xB8E8;&#xD504; &#xB9D0;&#xACE0; &#xB2E4;&#xB978; &#xBC29;&#xC2DD;&#xC73C;&#xB85C; &#xCEEC;&#xB809;&#xC158;&#xC744; &#xB2E4;&#xB8E8;&#xB294; &#xBC29;&#xBC95;&#xC774;&#xB77C;&#xB2C8;. &#xADF8;&#xB54C; &#xC0AC;&#xC6A9;&#xD588;&#xB358; &#xD568;&#xC218;&#xAC00; &#xBC14;&#xB85C; map, flatMap, reduce &#xC774;&#xB2E4;. &#xADF8;&#xB807;&#xAC8C; &#xC2A4;&#xCE7C;&#xB77C;&#xB97C; &#xACF5;&#xBD80;&#xD558;&#xAE30; &#xC2DC;&#xC791;&#xD55C; &#xAC83;&#xB3C4; &#xBC8C;&#xC368; 3&#xB144;&#xC774; &#xC9C0;&#xB0AC;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xC81C;&#xC11C;&#xC57C; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xACF5;&#xBD80;&#xD558;&#xAC8C; &#xB418;&#xC5C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC704;&#xC5D0; &#xB098;&#xC5F4;&#xD55C; &#xD568;&#xC218;&#xB4E4;&#xC774; &#xBAA8;&#xB098;&#xB4DC;, &#xBAA8;&#xB178;&#xC774;&#xB4DC;, &#xD391;&#xD130; &#xADF8;&#xB9AC;&#xACE0; &#xC774; &#xBAA8;&#xB4E0; &#xAC83;&#xB4E4;&#xC740; &#xCD1D;&#xCE6D;&#xD558;&#xB294; &#xBC94;&#xC8FC;&#xB860;(category theory) &#xC774;&#xB77C;&#xB294; &#xC5C4;&#xCCAD;&#xB09C; &#xC774;&#xB860;&#xC5D0; &#xADFC;&#xAC70;&#xD55C; &#xAC83;&#xC784;&#xC744; &#xAE68;&#xB2EB;&#xAC8C; &#xB418;&#xC5C8;&#xB2E4;. 3&#xB144; &#xB3D9;&#xC548; &#xC2A4;&#xCE7C;&#xB77C;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;&#xC11C; &#xADF8;&#xC800; &#xCEEC;&#xB809;&#xC158;&#xC744; &#xB2E4;&#xB8E8;&#xB294; &#xD568;&#xC218;&#xB85C;&#xB9CC; &#xC0DD;&#xAC01;&#xD588;&#xB358; &#xAC83;&#xC774; &#xC0C8;&#xB85C;&#xC6B4; &#xC815;&#xC758;&#xB85C; &#xB118;&#xC5B4;&#xAC00;&#xB294; &#xC21C;&#xAC04;&#xC5D0; &#xAE68;&#xB2EC;&#xC74C;&#xC740; &#xAD49;&#xC7A5;&#xD788; &#xB2EC;&#xCF64;&#xD588;&#xB2E4;. &#xBB3C;&#xB860; &#xADF8; &#xACFC;&#xC815;&#xC774; &#xC5C4;&#xCCAD;&#xB09C; &#xC5D0;&#xB108;&#xC9C0;&#xB97C; &#xC18C;&#xBAA8;&#xD588;&#xC9C0;&#xB9CC; &#xB9D0;&#xC774;&#xB2E4;.
&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xACF5;&#xBD80;&#xD558;&#xBA74;&#xC11C; &#xB290;&#xB080; &#xC810;&#xC740; &#xC774;&#xB860; &#xB9CC;&#xD07C;&#xC774;&#xB098; &#xC5B4;&#xB824;&#xC6B4; &#xC124;&#xBA85;&#xB4E4;&#xC774; &#xACC4;&#xC18D; &#xB418;&#xC5C8;&#xC9C0;&#xB9CC; &#xD55C;&#xC7A5;&#xC529; &#xB118;&#xC5B4;&#xAC08; &#xB54C;&#xB9C8;&#xB2E4; &#xC9C0;&#xC2DD;&#xC774; &#xC313;&#xC774;&#xB294; &#xB290;&#xB08C;&#xC774; &#xC88B;&#xC558;&#xB358; &#xAC83; &#xAC19;&#xB2E4;. &#xC774;&#xC81C; &#xC2A4;&#xD130;&#xB514;&#xAC00; &#xB05D;&#xB098;&#xACE0; &#xB354; &#xC774;&#xC0C1; &#xC774;&#xB7EC;&#xD55C; &#xC774;&#xB860;&#xC744; &#xB5A0;&#xC62C;&#xB9AC;&#xBA70; &#xD558;&#xB8E8;&#xD558;&#xB8E8;&#xB97C; &#xBCF4;&#xB0B4;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB41C;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xB108;&#xBB34;&#xB098; &#xAC10;&#xC0AC;&#xD560; &#xB2E4;&#xB984;&#xC774;&#xB2E4;.
&#xB098;&#xC911;&#xC5D0; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xACF5;&#xBD80;&#xD560; &#xC608;&#xC815;&#xC774;&#xACE0;, &#xC2A4;&#xCE7C;&#xB77C;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC870;&#xAE08; &#xC54C;&#xACE0; &#xC788;&#xB2E4;&#xBA74; &#xC774; &#xCC45;&#xC744; &#xAC15;&#xB825;&#xD558;&#xAC8C; &#xCD94;&#xCC9C;&#xD55C;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xAF2D; &#xAE34; &#xAE30;&#xAC04;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xC624;&#xB79C;&#xAE30;&#xAC04; &#xB418;&#xC0C8;&#xAE40;&#xC9C8;&#xC744; &#xD1B5;&#xD574; &#xD0D0;&#xD5D8;&#xD558;&#xBA74; &#xC88B;&#xACA0;&#xB2E4;&#xB294; &#xC870;&#xC5B8;&#xB3C4; &#xD558;&#xACE0; &#xC2F6;&#xB2E4;.</p>
<p>5&#xAC1C;&#xC6D4;&#xAC04;&#xC5D0; &#xAE34; &#xC2A4;&#xD130;&#xB514;&#xC784;&#xC5D0;&#xB3C4; &#xBD88;&#xAD6C;&#xD558;&#xACE0; &#xD568;&#xAED8; &#xD574;&#xC900; &#xAE40;&#xC9C4;&#xC5B5;&#xB2D8;, &#xAE40;&#xC9C0;&#xC218;&#xB2D8;, &#xAE40;&#xC900;&#xC12D;&#xB2D8;, &#xB0A8;&#xC11D;&#xD604;&#xB2D8;, &#xACE0;&#xC7AC;&#xB3C4;&#xB2D8;, &#xC774;&#xCC3D;&#xC5B8;&#xB2D8;, &#xC870;&#xB3D9;&#xD638;&#xB2D8;, &#xC815;&#xC9C4;&#xD0DC;&#xB2D8;, &#xAE40;&#xC18C;&#xC5F0;&#xB2D8;, &#xC591;&#xC6D0;&#xC11D;&#xB2D8;&#xAED8; &#xAC10;&#xC0AC;&#xB4DC;&#xB9BD;&#xB2C8;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xC5F4;&#xC815;&#xC801;&#xC774;&#xACE0; &#xCC38;&#xC5EC;&#xC728;&#xC774; &#xB192;&#xC740; &#xC2A4;&#xD130;&#xB514;&#xB294; 3&#xB144; &#xB3D9;&#xC548; &#xCC98;&#xC74C;&#xC774;&#xC5C8;&#xC2B5;&#xB2C8;&#xB2E4;. :)</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Chapter5.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: Ch5. 모나드">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Adix A. 후기","level":"1.7","depth":1,"previous":{"title":"Ch5. 모나드","level":"1.6","depth":1,"path":"Chapter5.md","ref":"Chapter5.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Functional programming in Scala","gitbook":"*"},"file":{"path":"Appendix-a.md","mtime":"2018-07-31T13:30:12.908Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-07-31T13:33:27.120Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

