
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Ch2. 참조 투명성, 순수성, 그리고 치환 모형 · Functional programming in Scala</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Chapter3.html" />
    
    
    <link rel="prev" href="Chapter1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Chapter1.html">
            
                <a href="Chapter1.html">
            
                    
                    Ch1. 패러다임의 전환
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="Chapter2.html">
            
                <a href="Chapter2.html">
            
                    
                    Ch2. 참조 투명성, 순수성, 그리고 치환 모형
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Chapter3.html">
            
                <a href="Chapter3.html">
            
                    
                    Ch3. 모노이드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Chapter4.html">
            
                <a href="Chapter4.html">
            
                    
                    Ch4. 펑터
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Chapter5.html">
            
                <a href="Chapter5.html">
            
                    
                    Ch5. 모나드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="Appendix-a.html">
            
                <a href="Appendix-a.html">
            
                    
                    Adix A. 후기
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Ch2. 참조 투명성, 순수성, 그리고 치환 모형</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="2&#xC7A5;-&#xCC38;&#xC870;-&#xD22C;&#xBA85;&#xC131;-&#xC21C;&#xC218;&#xC131;-&#xADF8;&#xB9AC;&#xACE0;-&#xCE58;&#xD658;-&#xBAA8;&#xD615;">2&#xC7A5; &#xCC38;&#xC870; &#xD22C;&#xBA85;&#xC131;, &#xC21C;&#xC218;&#xC131;, &#xADF8;&#xB9AC;&#xACE0; &#xCE58;&#xD658; &#xBAA8;&#xD615;</h2>
<p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xB354; &#xAE4A;&#xC774; &#xC788;&#xAC8C; &#xD0D0;&#xC0C9;&#xD558;&#xACE0;&#xC790; &#xD560; &#xB54C; &#xAF2D; &#xD544;&#xC694;&#xD55C; &#xC218;&#xD559;&#xC801; &#xC9C0;&#xC2DD;&#xACFC; &#xC6A9;&#xC5B4;&#xB4E4;&#xC774; &#xC788;&#xB2E4;. &#xC774;&#xBC88; &#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xC774;&#xB7EC;&#xD55C; &#xAC83;&#xB4E4;&#xC5D0; &#xB300;&#xD574; &#xCC28;&#xADFC;&#xCC28;&#xADFC; &#xC124;&#xBA85;&#xD574; &#xBCF4;&#xB824;&#xACE0; &#xD55C;&#xB2E4;. &#xB610;&#xD55C; &#xC9C0;&#xB8E8;&#xD568;&#xC744; &#xB2EC;&#xB798;&#xAE30; &#xC704;&#xD574; &#xAC04;&#xB2E8;&#xD55C; &#xC608;&#xC81C;&#xB4E4;&#xB3C4; &#xD568;&#xAED8; &#xD560; &#xAC83;&#xC774;&#xB2E4;.</p>
<h3 id="21-&#xD568;&#xC218;">2.1 &#xD568;&#xC218;</h3>
<p>&#xC6B0;&#xB9AC;&#xAC00; &#xBCF4;&#xD1B5; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xBC30;&#xC6B0;&#xBA74;&#xC11C; &#xCC98;&#xC74C; &#xBC30;&#xC6B0;&#xB294; &#xD568;&#xC218;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xB2E4;.</p>
<h5 id="&#xCF54;&#xB4DC;21-&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C;-&#xC0AC;&#xC6A9;&#xD558;&#xB294;-&#xD568;&#xC218;">&#xCF54;&#xB4DC;2.1 &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xD568;&#xC218;</h5>
<pre><code class="lang-java"><span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String[] args)</span></span>{
    System.out.println( <span class="hljs-string">&quot;Hello world&quot;</span>);
}
</code></pre>
<p>&#xC6B0;&#xB9AC;&#xAC00; &#xC55E;&#xC73C;&#xB85C; &#xB9C8;&#xC74C;&#xC18D;&#xC5D0; &#xD488;&#xC5B4;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xC774;&#xB7F0; &#xD568;&#xC218;&#xAC00; &#xC544;&#xB2C8;&#xB77C; &#xBC14;&#xB85C; &#xC218;&#xD559;(mathematics)&#xC5D0;&#xC11C;&#xC758; &#xD568;&#xC218;&#xC774;&#xB2E4;. &#xC218;&#xD559;&#xC801; &#xC758;&#xBBF8;&#xC758; &#xD568;&#xC218;&#xB294; &quot;&#xCCAB; &#xBC88;&#xC9F8; &#xC9D1;&#xD569;&#xC758; &#xC784;&#xC758;&#xC758; &#xD55C; &#xC6D0;&#xC18C;&#xB97C; &#xB450; &#xBC88;&#xC9F8; &#xC9D1;&#xD569;&#xC758; &#xC624;&#xC9C1; &#xD55C; &#xC6D0;&#xC18C;&#xC5D0; &#xB300;&#xC751;&#xC2DC;&#xD0A4;&#xB294; &#xB300;&#xC751; &#xAD00;&#xACC4;&#xC774;&#xB2E4;.&quot;&#xC774;&#xB2E4;.</p>
<h5 id="&#xADF8;&#xB9BC;21-&#xD568;&#xC218;-&#xAE30;&#xD638;-x&#xB294;-&#xC815;&#xC758;&#xC5ED;-y&#xB294;-&#xACF5;&#xC5ED;-fx&#xC758;-&#xD568;&#xC218;&#xB97C;-&#xC0AC;&#xC0C1;&#xD558;&#xC600;&#xC744;-&#xB54C;-&#xB098;&#xC624;&#xB294;-&#xACB0;&#xACFC;&#xC758;-&#xC9D1;&#xD569;&#xC744;-&#xCE58;&#xC5ED;-d-c&#xC774;&#xB77C;-&#xD55C;&#xB2E4;">&#xADF8;&#xB9BC;2.1 &#xD568;&#xC218; &#xAE30;&#xD638;, X&#xB294; &#xC815;&#xC758;&#xC5ED; Y&#xB294; &#xACF5;&#xC5ED;, f(x)&#xC758; &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC0C1;&#xD558;&#xC600;&#xC744; &#xB54C; &#xB098;&#xC624;&#xB294; &#xACB0;&#xACFC;&#xC758; &#xC9D1;&#xD569;&#xC744; &#xCE58;&#xC5ED;(; D, C)&#xC774;&#xB77C; &#xD55C;&#xB2E4;.</h5>
<p><img src="https://cloud.githubusercontent.com/assets/4495200/26612150/cc981708-45ed-11e7-9395-f3515eb054ab.png" alt="image"></p>
<p>&#xB450; &#xAC1C;&#xC758; &#xCC28;&#xC774;&#xB294; &#xBB34;&#xC5C7;&#xC77C;&#xAE4C;? &#xBC14;&#xB85C; &quot;&#xBD80;&#xC218; &#xD6A8;&#xACFC;(side effect)&quot;&#xC758; &#xC874;&#xC7AC; &#xC5EC;&#xBD80;&#xC774;&#xB2E4;. &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;(functional programming)&#xC5D0;&#xC11C;&#xB294; &#xBD80;&#xC218;&#xD6A8;&#xACFC;&#xAC00; &#xC5C6;&#xB294; &#xC218;&#xD559;&#xC801; &#xC6A9;&#xC5B4;&#xC758; &#xD568;&#xC218;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xD568;&#xC218;&#xB4E4;&#xC744; &#xAC00;&#xB9AC;&#xCF1C; &quot;&#xC21C;&#xC218;&#xD568;&#xC218;(pure function)&quot;&#xB77C; &#xD55C;&#xB2E4;.</p>
<p>&#xC21C;&#xC218; &#xD568;&#xC218;&#xB4E4;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD558;&#xBA74; &#xC5BB;&#xC744; &#xC218; &#xC788;&#xB294; &#xC7A5;&#xC810;&#xC740; &#xBAA8;&#xB4C8;&#xC131;(modularity)&#xAC00; &#xC99D;&#xAC00;&#xD558;&#xB294; &#xAC83;&#xC774;&#xB2E4;. &#xBAA8;&#xB4C8;&#xC131; &#xB355;&#xBD84;&#xC5D0; &#xC21C;&#xC218; &#xD568;&#xC218;&#xB294; &#xD14C;&#xC2A4;&#xD2B8;, &#xC7AC;&#xC0AC;&#xC6A9;, &#xBCD1;&#xB82C;&#xD654;, &#xBD84;&#xC11D;&#xC774; &#xB354; &#xC27D;&#xB2E4;. &#xB54C;&#xBB38;&#xC5D0; &#xC21C;&#xC218; &#xD568;&#xC218;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC791;&#xC131;&#xD558;&#xAC8C; &#xB418;&#xBA74; &#xBC84;&#xADF8;&#xAC00; &#xC0DD;&#xAE38; &#xC5EC;&#xC9C0;&#xB3C4; &#xD6E8;&#xC52C; &#xC801;&#xC5B4;&#xC9C4;&#xB2E4;.</p>
<h3 id="22-&#xBD80;&#xC218;&#xD6A8;&#xACFC;">2.2 &#xBD80;&#xC218;&#xD6A8;&#xACFC;</h3>
<p>&#xC55E;&#xC120; &#xC808;&#xC5D0;&#xC11C; &#xD568;&#xC218;&#xB97C; &#xC124;&#xBA85;&#xD558;&#xBA74;&#xC11C; &#xC21C;&#xC218; &#xD568;&#xC218;&#xB77C;&#xB294; &#xAC83;&#xC774; &quot;&#xBD80;&#xC218;&#xD6A8;&#xACFC;&quot;&#xAC00; &#xC5C6;&#xB294; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xC124;&#xBA85;&#xD588;&#xB2E4;. &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC790;&#xC8FC; &#xC811;&#xD558;&#xB358; &#xADF8; &#xBD80;&#xC218;&#xD6A8;&#xACFC;&#xB780; &#xACFC;&#xC5F0; &#xBB34;&#xC5C7;&#xC77C;&#xAE4C;? &#xC6B0;&#xB9AC;&#xAC00; &#xACF5;&#xBD80;&#xD588;&#xB358; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xCC45;&#xC5D0;&#xC11C;&#xB294; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; 7&#xAC1C;&#xC758; &#xC608;&#xB97C; &#xB4E4;&#xC5B4;&#xC8FC;&#xACE0; &#xC788;&#xB2E4;.</p>
<ul>
<li>&#xBCC0;&#xC218;&#xB97C; &#xC218;&#xC815;&#xD55C;&#xB2E4;.</li>
<li>&#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870;&#xB97C; &#xBCC0;&#xACBD;&#xD55C;&#xB2E4;.</li>
<li>&#xAC1D;&#xCCB4;&#xC758; &#xD544;&#xB4DC;&#xB97C; &#xC124;&#xC815;&#xD55C;&#xB2E4;.</li>
<li>&#xC608;&#xC678;(exception)&#xB97C; &#xB358;&#xC9C0;&#xAC70;&#xB098; &#xC624;&#xB958;&#xB97C; &#xB0B4;&#xBA74;&#xC11C; &#xC2E4;&#xD589;&#xC744; &#xC911;&#xB2E8;&#xD55C;&#xB2E4;.</li>
<li>&#xCF58;&#xC194;&#xC5D0; &#xCD9C;&#xB825;&#xD558;&#xAC70;&#xB098; &#xC0AC;&#xC6A9;&#xC790;&#xC758; &#xC785;&#xB825;&#xC744; &#xC77D;&#xC5B4;&#xB4E4;&#xC778;&#xB2E4;.</li>
<li>&#xD30C;&#xC77C;&#xC5D0; &#xAE30;&#xB85D;&#xD558;&#xAC70;&#xB098; &#xD30C;&#xC77C;&#xC5D0;&#xC11C; &#xC77D;&#xC5B4;&#xB4E4;&#xC778;&#xB2E4;.</li>
<li>&#xD654;&#xBA74;&#xC5D0; &#xADF8;&#xB9B0;&#xB2E4;.</li>
</ul>
<p>&#xBCC0;&#xC218;&#xB97C; &#xC218;&#xC815;&#xD558;&#xAC70;&#xB098; &#xC608;&#xC678;&#xB97C; &#xB358;&#xC9C0;&#xB294; &#xAC83;, &#xD30C;&#xC77C;&#xC5D0; &#xAE30;&#xB85D;&#xD558;&#xAC70;&#xB098; &#xC77D;&#xC5B4;&#xB4DC;&#xB9AC;&#xB294; &#xAC83;&#xC774; &#xC5C6;&#xC774; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC791;&#xC131;&#xD55C;&#xB2E4;&#xB294; &#xAC83;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC0C1;&#xC0C1;&#xD574;&#xBCF8;&#xC801;&#xC774; &#xC788;&#xB294;&#xAC00;? &#xC544;&#xB9C8;&#xB3C4; &#xC5C6;&#xAC70;&#xB098; &#xC808;&#xB300; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD560;&#xC9C0;&#xB3C4; &#xBAA8;&#xB974;&#xACA0;&#xB2E4;. &#xB2E4;&#xD589;&#xD558;&#xAC8C;&#xB3C4; &#xBD80;&#xC218;&#xD6A8;&#xACFC;&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xC5EC; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC791;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xBA70; &#xC774;&#xB807;&#xAC8C; &#xC791;&#xC5C5;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xBC30;&#xC6B0;&#xACE0;&#xB098;&#xBA74; &#xC55E;&#xC73C;&#xB85C; &#xD6E8;&#xC52C; &#xD589;&#xBCF5;&#xD574;&#xC9C8; &#xC218; &#xC788;&#xB2E4;.</p>
<h3 id="23-&#xCC38;&#xC870;-&#xD22C;&#xBA85;&#xC131;">2.3 &#xCC38;&#xC870; &#xD22C;&#xBA85;&#xC131;</h3>
<p>&#xC774;&#xC81C; &#xCC38;&#xC870; &#xD22C;&#xBA85;&#xC131;(referential transparency)&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC790;. &#xC6B0;&#xC120; &#xAC04;&#xB2E8;&#xD558;&#xAC8C; &#xB354;&#xD558;&#xAE30; &#xD568;&#xC218;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC790;.</p>
<h5 id="&#xCF54;&#xB4DC;-22-&#xB354;&#xD558;&#xAE30;-&#xD568;&#xC218;">&#xCF54;&#xB4DC; 2.2 &#xB354;&#xD558;&#xAE30; &#xD568;&#xC218;</h5>
<pre><code class="lang-scala"><span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">sum</span></span>(a: <span class="hljs-type">Int</span>, <span class="hljs-type">B</span>: <span class="hljs-type">Int</span>): <span class="hljs-type">Int</span> = {
  a + b
}
</code></pre>
<p>&#xB354;&#xD558;&#xAE30; &#xD568;&#xC218;&#xB294; &#xC815;&#xC218; &#xAC12; &#xB450;&#xAC1C;&#xB97C; &#xBC1B;&#xC544;&#xC11C; &#xAC12;&#xC744; &#xB354;&#xD55C; &#xAC12;&#xC744; &#xBC18;&#xD658;&#xD55C;&#xB2E4;. &#xC8FC;&#xC5B4;&#xC9C4; &#xC784;&#xC758;&#xC758; &#xB450; &#xC815;&#xC218;&#xC5D0; &#xB300;&#xD574; &#xC774; &#xD568;&#xC218;&#xB294; &#xD56D;&#xC0C1; &#xAC19;&#xC740; &#xAC12;&#xC744; &#xB3CC;&#xB824;&#xC900;&#xB2E4;.</p>
<p>&#xC608;&#xB97C; &#xB4E4;&#xC5B4; 2&#xC640; 3 &#xC22B;&#xC790;&#xB97C; &#xC704;&#xC758; sum &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD574;&#xC11C; &#xACB0;&#xACFC;&#xB97C; &#xB0B8;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD574;&#xBCF4;&#xC790;. &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC6B0;&#xB9AC;&#xAC00; &#xC218;&#xD559;&#xC5D0;&#xC11C; &#xC0DD;&#xAC01;&#xD588;&#xB358; 2 + 3 = 5&#xB77C;&#xB294; &#xACF5;&#xC2DD;&#xC744; &#xBA38;&#xB9AC;&#xC18D;&#xC5D0; &#xADF8;&#xB824;&#xB0BC; &#xC218; &#xC788;&#xACE0; &#xC774;&#xB294; &#xC785;&#xB825; &#xAC12; 2, 3&#xC5D0; &#xB300;&#xD574; &#xACB0;&#xACFC; &#xAC12; 5&#xAC00; &#xB098;&#xC624;&#xB294; &#xB3D9;&#xC791;&#xB9CC; &#xC218;&#xD589;&#xD560; &#xBFD0; &#xB2E4;&#xB978; &#xC77C;&#xC744; &#xD558;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;.</p>
<p>&#xC21C;&#xC218; &#xD568;&#xC218;&#xC758; &#xC774;&#xB7EC;&#xD55C; &#xAC1C;&#xB150;&#xC744; &#xBC14;&#xB85C; <strong>&#xCC38;&#xC870; &#xD22C;&#xBA85;&#xC131;</strong>&#xC774;&#xB77C; &#xD55C;&#xB2E4;. &#xC544;&#xB798;&#xB294; &#xC6B0;&#xB9AC;&#xAC00; &#xACF5;&#xBD80;&#xD55C; &#xCC45;&#xC5D0;&#xC11C; &#xBC1D;&#xD788;&#xACE0; &#xC788;&#xB294; &#xCC38;&#xC870; &#xD22C;&#xBA85;&#xC131;&#xACFC; &#xC21C;&#xC218;&#xC131;&#xC758; &#xC815;&#xC758;&#xC774;&#xB2E4;.</p>
<blockquote>
<p>&#xBAA8;&#xB4E0; &#xD504;&#xB85C;&#xADF8;&#xB7A8; p&#xC5D0; &#xB300;&#xD574; &#xD45C;&#xD604;&#xC2DD; e&#xC758; &#xBAA8;&#xB4E0; &#xCD9C;&#xD604;&#xC744; e&#xC758; &#xD3C9;&#xAC00;&#xB85C; &#xCE58;&#xD658;&#xD574;&#xB3C4; p&#xC758; &#xC758;&#xBBF8;&#xC5D0; &#xC544;&#xBB34; &#xC601;&#xD5A5;&#xC774; &#xBBF8;&#xCE58;&#xC9C0; &#xC54A;&#xB294;&#xB2E4;&#xBA74;, &#xADF8; &#xD45C;&#xD604;&#xC2DD; e&#xB294; &#xCC38;&#xC870;&#xC5D0; &#xD22C;&#xBA85;&#xD558;&#xB2E4;. &#xB9CC;&#xC77C; &#xD45C;&#xD604;&#xC2DD; f(x)&#xAC00; &#xCC38;&#xC870;&#xC5D0; &#xD22C;&#xBA85;&#xD55C; &#xBAA8;&#xB4E0; x&#xC5D0; &#xB300;&#xD574; &#xCC38;&#xC870;&#xC5D0; &#xD22C;&#xBA85;&#xD558;&#xBA74;, &#xD568;&#xC218; f&#xB294; &#xC21C;&#xC218;&#xD558;&#xB2E4;</p>
</blockquote>
<h3 id="24-&#xCE58;&#xD658;-&#xBAA8;&#xB378;">2.4 &#xCE58;&#xD658; &#xBAA8;&#xB378;</h3>
<p>&#xC5B4;&#xB5A4; &#xD568;&#xC218;&#xAC00; &#xCC38;&#xC870; &#xD22C;&#xBA85;&#xD558;&#xB2E4;&#xACE0; &#xD45C;&#xD604;&#xD560; &#xC218; &#xC788;&#xB294; &#xAC83;&#xC740; &#xC704;&#xC758; &#xC808;&#xC5D0;&#xC11C; &#xC5B8;&#xAE09;&#xD55C; &#xAC83;&#xCC98;&#xB7FC; &#xBAA8;&#xB4E0; &#xC785;&#xB825;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xADF8; &#xACB0;&#xACFC; &#xAC12;&#xC774; &#xD56D;&#xC0C1; &#xB3D9;&#xC77C;&#xD560; &#xB54C;&#xB97C; &#xB9D0;&#xD55C;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C; &#xD568;&#xC218;&#xAC00; &#xC774;&#xB7EC;&#xD55C; &#xC0AC;&#xD56D;&#xC744; &#xCDA9;&#xC2E4;&#xD788; &#xC774;&#xD589;&#xD558;&#xBA74; <strong>&#xCE58;&#xD658; &#xBAA8;&#xB378;(substitution model)</strong>&#xC774;&#xB77C;&#xACE0; &#xBD80;&#xB974;&#xB294; &#xCD94;&#xB860; &#xBAA8;&#xD615;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9C4;&#xB2E4;. &#xCC38;&#xC870; &#xD22C;&#xBA85;&#xC131;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0; &#xB300;&#xD55C; &#xB4F1;&#xC2DD;&#xC801; &#xCD94;&#xB860;&#xC744; &#xAC00;&#xB2A5;&#xD558;&#xAC8C; &#xD558;&#xB294;&#xB370; &#xC774;&#xB97C; &#xD65C;&#xC6A9;&#xD558;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC5D0;&#xC11C; &#xD568;&#xC218;&#xB97C; &#xC801;&#xADF9;&#xC801;&#xC73C;&#xB85C; &#xC7AC;&#xD65C;&#xC6A9;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE38;&#xC774; &#xC5F4;&#xB9AC;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</p>
<h3 id="25-&#xC815;&#xB9AC;">2.5 &#xC815;&#xB9AC;</h3>
<p>&#xC774;&#xBC88; &#xC7A5;&#xC5D0;&#xC11C;&#xB294; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C; &#xC774;&#xC57C;&#xAE30;&#xD558;&#xB294; &#xBA87; &#xAC00;&#xC9C0; &#xC6A9;&#xC5B4;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xB2E4;. &#xC5EC;&#xAE30;&#xC11C; &#xBA87; &#xAC00;&#xC9C0; &#xC5B8;&#xAE09;&#xD558;&#xC9C0; &#xC54A;&#xC740; &#xAC83;&#xC774; &#xC788;&#xB294;&#xB370; &#xADF8;&#xAC83;&#xC740; &#xB2E4;&#xC74C; &#xC7A5;&#xC5D0;&#xC11C; &#xD544;&#xC694;&#xD560; &#xB54C; &#xC5B8;&#xAE09;&#xD560; &#xAC83;&#xC774;&#xB2E4;. &#xC774;&#xBC88; &#xC7A5;&#xC5D0;&#xC11C; &#xAF2D; &#xAE30;&#xC5B5;&#xD560; &#xAC83;&#xC740; &#xBC14;&#xB85C; &quot;&#xBD80;&#xC218; &#xD6A8;&#xACFC;&quot;&#xC758; &#xC815;&#xC758;&#xC774;&#xB2E4;. &#xBD80;&#xC218;&#xD6A8;&#xACFC;&#xB294; &#xBCC0;&#xC218; &#xC218;&#xC815;, &#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870; &#xBCC0;&#xACBD;, &#xC608;&#xC678;&#xB97C; &#xB358;&#xC9C0;&#xB294; &#xAC83; &#xB4F1;&#xC774;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB7F0; &#xBD80;&#xC218;&#xD6A8;&#xACFC;&#xB97C; &#xC81C;&#xAC70;&#xD558;&#xBA74; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C; &#xAF2D; &#xC5B8;&#xAE09;&#xB418;&#xB294; &#xCC38;&#xC870;&#xD22C;&#xBA85;&#xC131;&#xACFC; &#xB9CC;&#xB098;&#xAC8C; &#xB41C;&#xB2E4;. &#xB2E4;&#xC74C;&#xC740; &#xBAA8;&#xB178;&#xC774;&#xB4DC;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC0B4;&#xD3B4;&#xBCFC; &#xCC28;&#xB840;&#xC774;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Chapter1.html" class="navigation navigation-prev " aria-label="Previous page: Ch1. 패러다임의 전환">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Chapter3.html" class="navigation navigation-next " aria-label="Next page: Ch3. 모노이드">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Ch2. 참조 투명성, 순수성, 그리고 치환 모형","level":"1.3","depth":1,"next":{"title":"Ch3. 모노이드","level":"1.4","depth":1,"path":"Chapter3.md","ref":"Chapter3.md","articles":[]},"previous":{"title":"Ch1. 패러다임의 전환","level":"1.2","depth":1,"path":"Chapter1.md","ref":"Chapter1.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Functional programming in Scala","gitbook":"*"},"file":{"path":"Chapter2.md","mtime":"2018-07-31T13:29:18.800Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-07-31T13:33:27.120Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

