
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Ch1. 패러다임의 전환 · Functional programming in Scala</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Chapter2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="Chapter1.html">
            
                <a href="Chapter1.html">
            
                    
                    Ch1. 패러다임의 전환
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="Chapter2.html">
            
                <a href="Chapter2.html">
            
                    
                    Ch2. 참조 투명성, 순수성, 그리고 치환 모형
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Chapter3.html">
            
                <a href="Chapter3.html">
            
                    
                    Ch3. 모노이드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Chapter4.html">
            
                <a href="Chapter4.html">
            
                    
                    Ch4. 펑터
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Chapter5.html">
            
                <a href="Chapter5.html">
            
                    
                    Ch5. 모나드
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="Appendix-a.html">
            
                <a href="Appendix-a.html">
            
                    
                    Adix A. 후기
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Ch1. 패러다임의 전환</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="1&#xC7A5;-&#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC758;-&#xC804;&#xD658;">1&#xC7A5; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC758; &#xC804;&#xD658;</h2>
<p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC54C;&#xC544;&#xBCF4;&#xAE30; &#xC804;&#xC5D0; &#xC65C; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xCD5C;&#xADFC; &#xC790;&#xC8FC; &#xC774;&#xC57C;&#xAE30;&#xB418;&#xACE0; &#xC788;&#xB294;&#xC9C0; &#xC9DA;&#xACE0; &#xB118;&#xC5B4;&#xAC00;&#xC57C; &#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC744; &#xAC83; &#xAC19;&#xB2E4;. &#xC774;&#xB807;&#xAC8C; &#xC57D;&#xC744; &#xD314;&#xC544;&#xC57C; &#xC774; &#xAE34; &#xAE00;&#xC744; &#xC77D;&#xC5B4;&#xC8FC;&#xC2E4; &#xAC83;&#xC774;&#xB2C8;&#xAE4C;. &#xAC00;&#xBCCD;&#xAC8C; &#xC77D;&#xC744; &#xC218; &#xC788;&#xB294; &#xC11C;&#xBB38;&#xC73C;&#xB85C;  &#xC900;&#xBE44;&#xD588;&#xB2E4;. &#xC790; &#xC774;&#xC81C; &#xC2DC;&#xC791;&#xD574;&#xBCF4;&#xC790;.</p>
<h3 id="11-&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;-&#xD328;&#xB7EC;&#xB2E4;&#xC784;">1.1 &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xD328;&#xB7EC;&#xB2E4;&#xC784;</h3>
<p>&#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC758; &#xC0AC;&#xC804;&#xC801; &#xC758;&#xBBF8;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;. &quot;&#xC5B4;&#xB5A4; &#xD55C; &#xC2DC;&#xB300; &#xC0AC;&#xB78C;&#xB4E4;&#xC758; &#xACAC;&#xD574;&#xB098; &#xC0AC;&#xACE0;&#xB97C; &#xADFC;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xADDC;&#xC815;&#xD558;&#xACE0; &#xC788;&#xB294; &#xD14C;&#xB450;&#xB9AC;&#xB85C;&#xC11C;&#xC758; &#xC778;&#xC2DD;&#xC758; &#xCCB4;&#xACC4;. &#xB610;&#xB294; &#xC0AC;&#xBB3C;&#xC5D0; &#xB300;&#xD55C; &#xC774;&#xB860;&#xC801;&#xC778; &#xD2C0;&#xC774;&#xB098; &#xCCB4;&#xACC4;&quot;. &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xB3C4; &#xC774;&#xB7F0; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC774; &#xC874;&#xC7AC;&#xD55C;&#xB2E4;. &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC758; &#xACAC;&#xD574;&#xB098; &#xC778;&#xC2DD;&#xC758; &#xCCB4;&#xACC4;&#xAC00; &#xBC14;&#xB85C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC774;&#xB2E4;. &#xB2EC;&#xB9AC; &#xC774;&#xC57C;&#xAE30;&#xD574;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC740; &#xAE30;&#xB2A5;&#xC5D0; &#xB530;&#xB77C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xB97C; &#xBD84;&#xB958;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC774;&#xB77C;&#xACE0; &#xC774;&#xC57C;&#xAE30; &#xD560; &#xC218; &#xC788;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC740; &#xD06C;&#xAC8C; 2&#xAC00;&#xC9C0;&#xB85C; &#xBD84;&#xB958;&#xAC00; &#xB418;&#xB294;&#xB370; &#xBA85;&#xB839;&#xD615; &#xD328;&#xB7EC;&#xB2E4;&#xC784;(imperative paradigm)&#xACFC; &#xC120;&#xC5B8;&#xD615; &#xD328;&#xB7EC;&#xB2E4;&#xC784;(declarative paradigm)&#xC774;&#xB2E4;.</p>
<p>&#xBA85;&#xB839;&#xD615; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC740; &#xB54C;&#xB54C;&#xB85C; &#xC808;&#xCC28;&#xC801;(Procedural)&#xACFC; &#xB3D9;&#xC758;&#xC5B4;&#xB85C; &#xC0AC;&#xC6A9;&#xB418;&#xBA70;, &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xC0C1;&#xD0DC;&#xC640; &#xC0C1;&#xD0DC;&#xB97C; &#xBCC0;&#xACBD;&#xC2DC;&#xD0A4;&#xB294; &#xAD6C;&#xBB38;&#xC758; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xC5F0;&#xC0B0;&#xC744; &#xC124;&#xBA85;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xB4E4;&#xC744; &#xB9D0;&#xD55C;&#xB2E4;. &#xC798; &#xC54C;&#xB824;&#xC838; &#xC788;&#xB294; C &#xC5B8;&#xC5B4;, Java, &#xD3EC;&#xD2B8;&#xB780;, &#xC54C;&#xACE8;, &#xD30C;&#xC2A4;&#xCE7C;, &#xC5D0;&#xC774;&#xB2E4; &#xAE4C;&#xC9C0;&#xAC00; &#xC774; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC744; &#xB530;&#xB974;&#xACE0; &#xC788;&#xB2E4;.</p>
<p>&#xC120;&#xC5B8;&#xD615; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC740; &#xC5F0;&#xC0B0;&#xC744; &#xC124;&#xBA85;&#xD558;&#xAE30; &#xBCF4;&#xB2E4;&#xB294; &#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC81C;&#xC2DC;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xAC00;&#xB9AC;&#xD0A8;&#xB2E4;. &#xC774;&#xB7EC;&#xD55C; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC5D0; &#xC18D;&#xD558;&#xB294; &#xAC83;&#xC774; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774;&#xBA70;, &#xC798; &#xC54C;&#xB824;&#xC838; &#xC788;&#xB294; &#xC5B8;&#xC5B4;&#xB85C; Scala, Groovy, &#xD074;&#xB85C;&#xC838;, &#xD558;&#xC2A4;&#xCF08; &#xB4F1;&#xC744; &#xB4E4; &#xC218; &#xC788;&#xB2E4;.</p>
<p>&#xCF54;&#xB4DC;&#xB85C; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xB450;&#xAC00;&#xC9C0;&#xC758; &#xCC28;&#xC774;&#xB97C; &#xC880; &#xB354; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xB290;&#xB084; &#xC218; &#xC788;&#xB2E4;. &#xC608;&#xC81C;&#xB294; &#xB204;&#xAD6C;&#xB098; &#xC774;&#xD574;&#xD560; &#xC218; &#xC788;&#xB294; &#xC218;&#xC900;&#xC778; 1 ~ 10 &#xC0AC;&#xC774;&#xC758; &#xC815;&#xC218;&#xB97C; &#xB354;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xC790;&#xBC14; &#xCF54;&#xB4DC;&#xB85C; &#xC900;&#xBE44;&#xD588;&#xB2E4;. &#xC544;&#xB798;&#xC758; &#xCF54;&#xB4DC;&#xB97C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC790;.</p>
<h5 id="&#xCF54;&#xB4DC;11-&#xBA85;&#xB839;&#xD615;&#xC758;-&#xC790;&#xBC14;-&#xCF54;&#xB4DC;">&#xCF54;&#xB4DC;1.1 &#xBA85;&#xB839;&#xD615;&#xC758; &#xC790;&#xBC14; &#xCF54;&#xB4DC;</h5>
<pre><code class="lang-java"><span class="hljs-keyword">int</span> sum = <span class="hljs-number">0</span>
<span class="hljs-keyword">for</span>(<span class="hljs-keyword">int</span> i = <span class="hljs-number">1</span> ; i &lt;= <span class="hljs-number">10</span>; i++ ) {
    sum = sum + i;
}
</code></pre>
<h5 id="&#xCF54;&#xB4DC;21-&#xC120;&#xC5B8;&#xD615;&#xC758;-&#xC790;&#xBC14;-&#xCF54;&#xB4DC;">&#xCF54;&#xB4DC;2.1 &#xC120;&#xC5B8;&#xD615;&#xC758; &#xC790;&#xBC14; &#xCF54;&#xB4DC;</h5>
<pre><code class="lang-java"><span class="hljs-keyword">int</span> sum = IntStream.rangeClosed(<span class="hljs-number">1</span>, <span class="hljs-number">10</span>).reduce(<span class="hljs-number">0</span>, (a, b) -&gt; a+b)
</code></pre>
<p>&#xC6B0;&#xC120; &#xCF54;&#xB4DC;1&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xBA74; &#xC804;&#xD615;&#xC801;&#xC778; &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC73C;&#xB85C; &#xC6B0;&#xC120; sum &#xBCC0;&#xC218;&#xB97C; &#xB9CC;&#xB4E4;&#xACE0;(; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xC0C1;&#xD0DC;) 1 &#xBD80;&#xD130; 10&#xAE4C;&#xC9C0;&#xB97C; &#xBC18;&#xBCF5;&#xD558;&#xBA74;&#xC11C; &#xADF8; &#xC218;&#xB97C; sum&#xC5D0; &#xBC18;&#xBCF5;&#xC801;&#xC73C;&#xB85C; &#xB354;&#xD55C;&#xB2E4; (; &#xADF8; &#xC0C1;&#xD0DC;&#xB97C; &#xBCC0;&#xACBD; ).</p>
<p>&#xCF54;&#xB4DC;2&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC0B4;&#xD3B4;&#xBCF4;&#xC790; IntStream&#xC740; &#xC790;&#xBC14;8&#xC5D0;&#xC11C; &#xCD94;&#xAC00; &#xB41C; &#xAC83;&#xC73C;&#xB85C; IntStream.rangeClosed(1, 10)&#xCF54;&#xB4DC; &#xAE4C;&#xC9C0; &#xC2E4;&#xD589;&#xB418;&#xACE0; &#xB098;&#xBA74; 1 ~ 10&#xAE4C;&#xC9C0;&#xC758; &#xBC30;&#xC5F4;&#xC774; &#xC0DD;&#xAE30;&#xAC8C; &#xB418;&#xACE0;(; &#xC2E4;&#xC81C;&#xB85C; &#xBC30;&#xC5F4;&#xC774; &#xC0DD;&#xC131;&#xB418;&#xB294; &#xAC74; &#xC544;&#xB2C8;&#xC9C0;&#xB9CC; &#xC9C0;&#xAE08;&#xC740; &#xADF8;&#xB807;&#xAC8C; &#xC0DD;&#xAC01;&#xD558;&#xC790;.), &#xC774;&#xD6C4;&#xC5D0; reduce&#xB294; &#xCD08;&#xAE43; &#xAC12;&#xC740; 0&#xC774;&#xACE0; &#xAC01; &#xC6D0;&#xC18C;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xB450; &#xAC1C;&#xB97C; &#xB354;&#xD558;&#xB77C;&#xACE0; &#xC9C0;&#xC2DC;(; &#xBB38;&#xC81C; &#xD574;&#xACB0; &#xBC29;&#xBC95;&#xC744; &#xC81C;&#xC2DC;)&#xD558;&#xAC8C; &#xB41C;&#xB2E4;.</p>
<p>&#xC790; &#xC774;&#xC81C; &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xACFC; &#xC120;&#xC5B8;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xCC28;&#xC774;&#xB97C; &#xC870;&#xAE08; &#xB290;&#xB084; &#xC218; &#xC788;&#xB294;&#xAC00;? &#xC774; &#xC791;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC73C;&#xB85C; &#xADF8; &#xAD6C;&#xBD84;&#xC774; &#xBA85;&#xD655;&#xD558;&#xAC8C; &#xB418;&#xC9C0; &#xC54A;&#xC744; &#xD14C;&#xC9C0;&#xB9CC; &#xADF8; &#xC870;&#xADF8;&#xB9CC; &#xCC28;&#xC774;&#xB97C; &#xB290;&#xB07C;&#xB294; &#xAC83;&#xB9CC;&#xC73C;&#xB85C;&#xB3C4; &#xC9C0;&#xAE08;&#xC740; &#xCDA9;&#xBD84;&#xD558;&#xB2E4;.</p>
<h3 id="12-&#xACFC;&#xAC70;&#xC5D0;&#xC11C;-&#xBBF8;&#xB798;&#xB85C;">1.2 &#xACFC;&#xAC70;&#xC5D0;&#xC11C; &#xBBF8;&#xB798;&#xB85C;</h3>
<p>&#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC65C; &#xC138;&#xACC4;&#xC758; &#xC8FC;&#xB958; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC740; &#xC120;&#xC5B8;&#xC801; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xC544;&#xB2C8;&#xB77C; &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xB418;&#xC5C8;&#xC744;&#xAE4C;? &#xC624;&#xB798;&#xBD80;&#xD130; &#xB450; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC740; &#xD568;&#xAED8; &#xC874;&#xC7AC;&#xD588;&#xC9C0;&#xB9CC; 7~80&#xB144;&#xB300;&#xAC00; &#xC9C0;&#xB098;&#xAC00;&#xBA74;&#xC11C; &#xC8FC;&#xB958;&#xAC00; &#xB41C; &#xAC83;&#xC774; &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774;&#xC5C8;&#xB2E4;. &#xADF8; &#xC774;&#xC720;&#xB294; &#xC544;&#xB9C8;&#xB3C4; &#xAE30;&#xACC4;&#xC5B4; &#xC600;&#xC744; &#xAC83;&#xC774;&#xB2E4;. ADD, MOV, INTO, SUM&#xB4F1;&#xC758; &#xBA85;&#xB839;&#xC5B4;&#xAC00; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xAC8C;&#xB098; &#xC0AC;&#xB78C;&#xC5D0;&#xAC8C;&#xB098; &#xB354; &#xC9C1;&#xAD00;&#xC801;&#xC774;&#xC5C8;&#xB2E4;. 1:1&#xB85C; &#xC62E;&#xAE30;&#xAE30;&#xB9CC; &#xD558;&#xBA74; &#xB418;&#xC5C8;&#xC744;&#xD14C;&#xB2C8;&#xAE4C;. &#xB610;&#xD55C; &#xADF8; &#xC2DC;&#xB300;&#xC758; &#xCEF4;&#xD4E8;&#xD130; &#xC131;&#xB2A5;&#xC774; &#xADF8;&#xB807;&#xAC8C; &#xC88B;&#xC9C0; &#xBABB;&#xD588;&#xB2E4;&#xB294; &#xAC83;&#xB3C4; &#xD55C; &#xBAAB; &#xD560; &#xAC83;&#xC774;&#xB77C;&#xACE0; &#xCD94;&#xCE21;&#xB41C;&#xB2E4;. &#xCEF4;&#xD4E8;&#xD130; &#xC131;&#xB2A5;&#xC774; &#xB098;&#xC058;&#xB2E4;&#xB294; &#xAC83;&#xC740; &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC758; &#xC131;&#xB2A5;&#xC774; &#xC88B;&#xC9C0; &#xBABB;&#xD558;&#xB2E8; &#xC774;&#xC57C;&#xAE30;&#xAC00; &#xB420; &#xAC83;&#xC774;&#xACE0;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC758; &#xC131;&#xB2A5;&#xC774; &#xB098;&#xC058;&#xB2E4;&#xB294; &#xC774;&#xC57C;&#xAE30;&#xB294; &#xACE7; &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xB354; &#xC88B;&#xC740; &#xAC1C;&#xBC1C; &#xD658;&#xACBD;&#xC774;&#xC5C8;&#xB2E4;&#xB294; &#xC774;&#xC57C;&#xAE30;&#xAC00; &#xB420; &#xAC83;&#xC774;&#xB2E4;.</p>
<p>&#xADF8;&#xB807;&#xC9C0;&#xB9CC; &#xAE30;&#xBED0;&#xD558;&#xC2DC;&#xB77C;. &#xB354;&#xC774;&#xC0C1; &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xB9CC; &#xD574;&#xC57C; &#xD558;&#xB294; &#xC2DC;&#xB300;&#xB294; &#xC9C0;&#xB0AC;&#xB2E4;. &#xC138;&#xACC4;&#xC5D0; &#xB9CE;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBA38;&#xB4E4;&#xC774; &#xC120;&#xC5B8;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB9E4;&#xB825;&#xC744; &#xB290;&#xAEF4; &#xC55E;&#xB2E4;&#xD22C;&#xC5B4; &#xC774; &#xD750;&#xB984;&#xC5D0; &#xCC38;&#xC5EC;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xB610;&#xD55C; &#xB9CE;&#xC740; &#xC5B8;&#xC5B4;&#xB4E4;&#xC774; &#xC120;&#xC5B8;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC9C0;&#xC6D0;&#xD558;&#xBA70;, &#xCEF4;&#xD30C;&#xC77C;&#xB7EC;&#xC758; &#xC131;&#xB2A5; &#xB610;&#xD55C; &#xC774;&#xB97C; &#xC9C0;&#xC6D0;&#xD558;&#xB294;&#xB370; &#xBD80;&#xC871;&#xD568;&#xC774; &#xC5C6;&#xB2E4;.</p>
<p>&#xBB3C;&#xB860; &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xC120;&#xB450;, &#xB09C;&#xACF5;&#xBD88;&#xB77D;&#xC758; &#xC790;&#xBC14;&#xB97C; &#xB118;&#xC5B4;&#xC11C;&#xAE30;&#xC5D4; &#xC544;&#xC9C1;&#xB3C4; &#xAC08;&#xAE38;&#xC774; &#xD55C;&#xCC38; &#xBA40;&#xC5C8;&#xC9C0;&#xB9CC; JDK8&#xC5D0; &#xC8FC;&#xC694; &#xAE30;&#xB2A5;&#xC778; Stream API&#xAC00; &#xB4E4;&#xC5B4;&#xC624;&#xBA74;&#xC11C; &#xC775;&#xBA85; &#xD568;&#xC218; &#xC0AC;&#xC6A9;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC84C;&#xB2E4;. &#xC544;&#xC9C1;&#xC740; &#xBD80;&#xC871;&#xD568;&#xC774; &#xB9CE;&#xC9C0;&#xB9CC; &#xC774;&#xC81C; &#xC790;&#xBC14;&#xB85C;&#xB3C4; &#xC120;&#xC5B8;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC84C;&#xB2E4;&#xB294; &#xC774;&#xC57C;&#xAE30;&#xB2E4;. &#xD544;&#xC790;&#xB4E4;&#xC740; &#xC55E;&#xC73C;&#xB85C; &#xC790;&#xBC14; &#xC9C4;&#xC601;&#xC5D0;&#xC11C; &#xB354;&#xC6B1; &#xC120;&#xC5B8;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xBC1B;&#xC544;&#xB4E4;&#xC774;&#xB9AC;&#xB77C;&#xACE0; &#xC0DD;&#xAC01;&#xD55C;&#xB2E4;.</p>
<h3 id="13--&#xD568;&#xC218;&#xD615;-&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;functional-programming">1.3  &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;(Functional Programming)</h3>
<p>&#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xB300;&#xD45C;&#xB294; &#xB2E8;&#xC5F0;&#xCF54; &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774;&#xB2E4;. &#xADF8;&#xB807;&#xB2E4;&#xBA74; &#xC120;&#xC5B8;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xB300;&#xD45C;&#xB294; &#xBB34;&#xC5C7;&#xC77C;&#xAE4C;? &#xC9D0;&#xC791;&#xD558;&#xACE0; &#xC788;&#xACA0;&#xC9C0;&#xB9CC; &#xC774;&#xB294; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774;&#xB2E4;. &#xC790; &#xC774;&#xC81C; &#xB4DC;&#xB514;&#xC5B4; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC774;&#xC57C;&#xAE30; &#xD574;&#xBCF4;&#xC790;.</p>
<p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC704;&#xD0A4;&#xD53C;&#xB514;&#xC544;&#xB97C; &#xAC80;&#xC0C9;&#xD574;&#xBCF4;&#xBA74; &#xC544;&#xB798;&#xC640; &#xAC19;&#xC774; &#xC124;&#xBA85;&#xD558;&#xACE0; &#xC788;&#xB2E4;.</p>
<blockquote>
<p>&#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC740; &#xC790;&#xB8CC; &#xCC98;&#xB9AC;&#xB97C; &#xC218;&#xD559;&#xC801; &#xD568;&#xC218;&#xC758; &#xACC4;&#xC0B0;&#xC73C;&#xB85C; &#xCDE8;&#xAE09;&#xD558;&#xACE0; &#xC0C1;&#xD0DC;&#xC640; &#xAC00;&#xBCC0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBA40;&#xB9AC;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC758; &#xD558;&#xB098;&#xC774;&#xB2E4;. &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C;&#xB294; &#xC0C1;&#xD0DC;&#xB97C; &#xBC14;&#xAFB8;&#xB294; &#xAC83;&#xC744; &#xAC15;&#xC870;&#xD558;&#xB294; &#xAC83;&#xACFC;&#xB294; &#xB2EC;&#xB9AC;, &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC740; &#xD568;&#xC218;&#xC758; &#xC751;&#xC6A9;&#xC744; &#xAC15;&#xC870;&#xD55C;&#xB2E4;. &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC740; 1930&#xB144;&#xB300;&#xC5D0; &#xACC4;&#xC0B0;&#xAC00;&#xB2A5;&#xC131;, &#xACB0;&#xC815;&#xBB38;&#xC81C;, &#xD568;&#xC218;&#xC815;&#xC758;, &#xD568;&#xC218;&#xC751;&#xC6A9;&#xACFC; &#xC7AC;&#xADC0;&#xB97C; &#xC5F0;&#xAD6C;&#xD558;&#xAE30; &#xC704;&#xD574; &#xAC1C;&#xBC1C;&#xB41C; &#xD615;&#xC2DD;&#xCCB4;&#xACC4;&#xC778; &#xB78C;&#xB2E4; &#xB300;&#xC218;&#xC5D0; &#xADFC;&#xAC04;&#xC744; &#xB450;&#xACE0; &#xC788;&#xB2E4;. &#xB2E4;&#xC218;&#xC758; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xB4E4;&#xC740; &#xB78C;&#xB2E4; &#xC5F0;&#xC0B0;&#xC744; &#xBC1C;&#xC804;&#xC2DC;&#xD0A8; &#xAC83;&#xC73C;&#xB85C; &#xBCFC; &#xC218; &#xC788;&#xB2E4;.</p>
</blockquote>
<p>&#xC218;&#xD559;&#xC801; &#xD568;&#xC218;&#xC640; &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xB418;&#xB294; &#xD568;&#xC218;&#xB294; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xB294;&#xB370;, &#xBA85;&#xB839;&#xD615;&#xC758; &#xD568;&#xC218;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC0C1;&#xD0DC;&#xC758; &#xAC12;&#xC744; &#xBC14;&#xAFC0; &#xC218; &#xC788;&#xB294; &#xBD80;&#xC791;&#xC6A9;&#xC774; &#xC0DD;&#xAE38; &#xC218; &#xC788;&#xB2E4;. &#xC774; &#xB54C;&#xBB38;&#xC5D0; &#xBA85;&#xB839;&#xD615; &#xD568;&#xC218;&#xB294; &#xCC38;&#xC870; &#xD22C;&#xBA85;&#xC131;&#xC774; &#xC5C6;&#xACE0;, &#xAC19;&#xC740; &#xCF54;&#xB4DC;&#xB77C;&#xB3C4; &#xC2E4;&#xD589;&#xB418;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xC0C1;&#xD0DC;&#xC5D0; &#xB530;&#xB77C; &#xB2E4;&#xB978; &#xACB0;&#xACFC;&#xAC12;&#xC744; &#xB0BC; &#xC218; &#xC788;&#xB2E4;. &#xBC18;&#xB300;&#xB85C; &#xD568;&#xC218;&#xD615; &#xCF54;&#xB4DC;&#xC5D0;&#xC11C;&#xB294; &#xD568;&#xC218;&#xC758; &#xCD9C;&#xB825;&#xAC12;&#xC740; &#xADF8; &#xD568;&#xC218;&#xC5D0; &#xC785;&#xB825;&#xB41C; &#xC778;&#xC218;&#xC5D0;&#xB9CC; &#xC758;&#xC874;&#xD558;&#xBBC0;&#xB85C; &#xC778;&#xC218; x&#xC5D0; &#xAC19;&#xC740; &#xAC12;&#xC744; &#xB123;&#xACE0; &#xD568;&#xC218; f&#xB97C; &#xD638;&#xCD9C;&#xD558;&#xBA74; &#xD56D;&#xC0C1; f(x)&#xB77C;&#xB294; &#xACB0;&#xACFC;&#xAC00; &#xB098;&#xC628;&#xB2E4;. &#xBD80;&#xC791;&#xC6A9;&#xC744; &#xC81C;&#xAC70;&#xD558;&#xBA74; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC758; &#xB3D9;&#xC791;&#xC744; &#xC774;&#xD574;&#xD558;&#xACE0; &#xC608;&#xCE21;&#xD558;&#xAE30;&#xAC00; &#xD6E8;&#xC52C; &#xC27D;&#xAC8C; &#xB41C;&#xB2E4;. &#xC774;&#xAC83;&#xC774; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC73C;&#xB85C; &#xAC1C;&#xBC1C;&#xD558;&#xB824;&#xB294; &#xD575;&#xC2EC; &#xB3D9;&#xAE30;&#xC911; &#xD558;&#xB098;&#xC774;&#xB2E4;.
&#xC704;&#xC758; &#xAE00;&#xC5D0;&#xC11C; &#xD575;&#xC2EC; &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xBF51;&#xC544;&#xBCF4;&#xBA74; <code>&#xC218;&#xD559;&#xC801; &#xD568;&#xC218;</code>, <code>&#xBD88;&#xBCC0; &#xB370;&#xC774;&#xD130;(;&#xAC00;&#xBCC0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBA40;&#xB9AC;&#xD568;)</code>, <code>&#xC7AC;&#xADC0;</code>, <code>&#xB78C;&#xB2E4;</code>, <code>&#xBD80;&#xC791;&#xC6A9;</code>&#xC744; &#xCC3E;&#xC544;&#xBCFC; &#xC218; &#xC788;&#xB2E4;. &#xC790; &#xC774; &#xB124; &#xAC00;&#xC9C0; &#xD0A4;&#xC6CC;&#xB4DC;&#xB97C; &#xAF2D; &#xB9C8;&#xC74C;&#xC18D;&#xC5D0; &#xAE30;&#xC5B5;&#xD574;&#xB450;&#xC790;. &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xACF5;&#xBD80;&#xD558;&#xBA74;&#xC11C; &#xAF2D; &#xAE30;&#xC5B5;&#xD574;&#xC57C; &#xD558;&#xB294; &#xD0A4;&#xC6CC;&#xB4DC; &#xB4E4;&#xC774;&#xB2E4;.</p>
<h3 id="14-&#xC815;&#xB9AC;">1.4. &#xC815;&#xB9AC;</h3>
<p>&#xC774;&#xBC88; &#xC7A5;&#xC744; &#xD1B5;&#xD574;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xD328;&#xB7EC;&#xB2E4;&#xC784;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC0B4;&#xD3B4;&#xBD24;&#xB2E4;. &#xBA85;&#xB839;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC740; &quot;&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; &#xC0C1;&#xD0DC;&#xC640; &#xC0C1;&#xD0DC;&#xB97C; &#xBCC0;&#xACBD;&#xC2DC;&#xD0A4;&#xB294; &#xAD6C;&#xBB38;&#xC758; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xC5F0;&#xC0B0;&#xC744; &#xC124;&#xBA85;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&quot; &#xC774;&#xBA70;, &#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xC788;&#xACE0;, &#xC120;&#xC5B8;&#xC801; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC740; &quot;&#xBB38;&#xC81C;&#xB97C; &#xD574;&#xACB0;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC744; &#xC81C;&#xC2DC;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&quot;&#xC774;&#xBA70;, &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC774; &#xC788;&#xB2E4;&#xB294; &#xAC83;&#xC744; &#xC54C;&#xC544;&#xBCF4;&#xC558;&#xB2E4;. &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC758; 4&#xAC00;&#xC9C0; &#xD575;&#xC2EC; &#xD0A4;&#xC6CC;&#xB4DC; <code>&#xC218;&#xD559;&#xC801; &#xD568;&#xC218;</code>, <code>&#xBD88;&#xBCC0; &#xB370;&#xC774;&#xD130;</code>, <code>&#xB78C;&#xB2E4;</code>, <code>&#xBD80;&#xC791;&#xC6A9;</code> &#xC774;&#xB77C;&#xB294; &#xAC83;&#xC744; &#xC0B4;&#xD3B4;&#xBCF4;&#xC558;&#xB2E4;. &#xC790; &#xD568;&#xC218;&#xD615; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xB300;&#xD574;&#xC11C; &#xC5B4;&#xB290;&#xC815;&#xB3C4; &#xC54C;&#xC544; &#xBCF4;&#xC558;&#xC73C;&#xB2C8; &#xC774;&#xC81C; &#xB2E4;&#xC74C;&#xC73C;&#xB85C; &#xB118;&#xC5B4;&#xAC08; &#xC900;&#xBE44;&#xAC00; &#xB05D;&#xB0AC;&#xB2E4;.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Chapter2.html" class="navigation navigation-next " aria-label="Next page: Ch2. 참조 투명성, 순수성, 그리고 치환 모형">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Ch1. 패러다임의 전환","level":"1.2","depth":1,"next":{"title":"Ch2. 참조 투명성, 순수성, 그리고 치환 모형","level":"1.3","depth":1,"path":"Chapter2.md","ref":"Chapter2.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Functional programming in Scala","gitbook":"*"},"file":{"path":"Chapter1.md","mtime":"2018-07-31T13:29:02.254Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-07-31T13:33:27.120Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

